//هذا الملف للتحكم بحجم الصورة عن طريق الرابط تبعها باضافة الرقم الذي نريده لتعيين حجمها
//هذه الدالة مهمتها التعديل على رابط الصورة الذي سينرسله لها
import noImage from "../assets/images/noImage.jpg"; //اذا لم يكن هنالك صورة موجودة نضع صورة افتراضية مكانها
const getCroppedImageUrl = (url) => {
  if (!url) return noImage; //اذا لم تكن هنالك صورة سيرجع null
  const target = "media/"; //للتنظيم استبدال كلمة ميديا بمتغير لتنظيم الكود
  const index = url.indexOf(target) + target.length; //البحث عن هذه الكلمة ضمن الرابط ومعرفة الدليل تبعها وتخزينه بالمتغير بالإضافة لطول الكلمة نفسها (ليتم الأضافة بعد هذه الكلمة)
  return url.slice(0, index) + "crop/600/400/" + url.slice(index); //بهذه التعليمة جلب الرابط من الأول الى نهاية كلمة الميديا واضاف عليها كلمة الحجم التي تحدد الحجم بالإضافة الى الباقي من الكود من الميديا الى النهاية باعتبار اننا خزنا الدليل تبع الميديا بالاندكس
};
export default getCroppedImageUrl; //لتصدير هذه الدالة ليتم رؤتها بغير ملفات
